MikroElektronika/core_packages/PIC/XC8/def/PIC16F15376/mcu.h
extern volatile PWM6DCHbits_t PWM6DCHbits __at(0x38D);
// bitfield macros
#define _PWM6DCH_DC_POSN                                    0x0
#define _PWM6DCH_DC_POSITION                                0x0
#define _PWM6DCH_DC_SIZE                                    0x8
#define _PWM6DCH_DC_LENGTH                                  0x8
#define _PWM6DCH_DC_MASK                                    0xFF
#define _PWM6DCH_DC2_POSN                                   0x0
#define _PWM6DCH_DC2_POSITION                               0x0
#define _PWM6DCH_DC2_SIZE                                   0x1
#define _PWM6DCH_DC2_LENGTH                                 0x1
#define _PWM6DCH_DC2_MASK                                   0x1
#define _PWM6DCH_DC3_POSN                                   0x1
#define _PWM6DCH_DC3_POSITION                               0x1
#define _PWM6DCH_DC3_SIZE                                   0x1
#define _PWM6DCH_DC3_LENGTH                                 0x1
#define _PWM6DCH_DC3_MASK                                   0x2
#define _PWM6DCH_DC4_POSN                                   0x2
#define _PWM6DCH_DC4_POSITION                               0x2
#define _PWM6DCH_DC4_SIZE                                   0x1
#define _PWM6DCH_DC4_LENGTH                                 0x1
#define _PWM6DCH_DC4_MASK                                   0x4
#define _PWM6DCH_DC5_POSN                                   0x3
#define _PWM6DCH_DC5_POSITION                               0x3
#define _PWM6DCH_DC5_SIZE                                   0x1
#define _PWM6DCH_DC5_LENGTH                                 0x1
#define _PWM6DCH_DC5_MASK                                   0x8
#define _PWM6DCH_DC6_POSN                                   0x4
#define _PWM6DCH_DC6_POSITION                               0x4
#define _PWM6DCH_DC6_SIZE                                   0x1
#define _PWM6DCH_DC6_LENGTH                                 0x1
#define _PWM6DCH_DC6_MASK                                   0x10
#define _PWM6DCH_DC7_POSN                                   0x5
#define _PWM6DCH_DC7_POSITION                               0x5
#define _PWM6DCH_DC7_SIZE                                   0x1
#define _PWM6DCH_DC7_LENGTH                                 0x1
#define _PWM6DCH_DC7_MASK                                   0x20
#define _PWM6DCH_DC8_POSN                                   0x6
#define _PWM6DCH_DC8_POSITION                               0x6
#define _PWM6DCH_DC8_SIZE                                   0x1
#define _PWM6DCH_DC8_LENGTH                                 0x1
#define _PWM6DCH_DC8_MASK                                   0x40
#define _PWM6DCH_DC9_POSN                                   0x7
#define _PWM6DCH_DC9_POSITION                               0x7
#define _PWM6DCH_DC9_SIZE                                   0x1
#define _PWM6DCH_DC9_LENGTH                                 0x1
#define _PWM6DCH_DC9_MASK                                   0x80
#define _PWM6DCH_PWM6DC2_POSN                               0x0
#define _PWM6DCH_PWM6DC2_POSITION                           0x0
#define _PWM6DCH_PWM6DC2_SIZE                               0x1
#define _PWM6DCH_PWM6DC2_LENGTH                             0x1
#define _PWM6DCH_PWM6DC2_MASK                               0x1
#define _PWM6DCH_PWM6DC3_POSN                               0x1
#define _PWM6DCH_PWM6DC3_POSITION                           0x1
#define _PWM6DCH_PWM6DC3_SIZE                               0x1
#define _PWM6DCH_PWM6DC3_LENGTH                             0x1
#define _PWM6DCH_PWM6DC3_MASK                               0x2
#define _PWM6DCH_PWM6DC4_POSN                               0x2
#define _PWM6DCH_PWM6DC4_POSITION                           0x2
#define _PWM6DCH_PWM6DC4_SIZE                               0x1
#define _PWM6DCH_PWM6DC4_LENGTH                             0x1
#define _PWM6DCH_PWM6DC4_MASK                               0x4
#define _PWM6DCH_PWM6DC5_POSN                               0x3
#define _PWM6DCH_PWM6DC5_POSITION                           0x3
#define _PWM6DCH_PWM6DC5_SIZE                               0x1
#define _PWM6DCH_PWM6DC5_LENGTH                             0x1
#define _PWM6DCH_PWM6DC5_MASK                               0x8
#define _PWM6DCH_PWM6DC6_POSN                               0x4
#define _PWM6DCH_PWM6DC6_POSITION                           0x4
#define _PWM6DCH_PWM6DC6_SIZE                               0x1
#define _PWM6DCH_PWM6DC6_LENGTH                             0x1
#define _PWM6DCH_PWM6DC6_MASK                               0x10
#define _PWM6DCH_PWM6DC7_POSN                               0x5
#define _PWM6DCH_PWM6DC7_POSITION                           0x5
#define _PWM6DCH_PWM6DC7_SIZE                               0x1
#define _PWM6DCH_PWM6DC7_LENGTH                             0x1
#define _PWM6DCH_PWM6DC7_MASK                               0x20
#define _PWM6DCH_PWM6DC8_POSN                               0x6
#define _PWM6DCH_PWM6DC8_POSITION                           0x6
#define _PWM6DCH_PWM6DC8_SIZE                               0x1
#define _PWM6DCH_PWM6DC8_LENGTH                             0x1
#define _PWM6DCH_PWM6DC8_MASK                               0x40
#define _PWM6DCH_PWM6DC9_POSN                               0x7
#define _PWM6DCH_PWM6DC9_POSITION                           0x7
#define _PWM6DCH_PWM6DC9_SIZE                               0x1
#define _PWM6DCH_PWM6DC9_LENGTH                             0x1
#define _PWM6DCH_PWM6DC9_MASK                               0x80
#define _PWM6DCH_PWMPW2_POSN                                0x0
#define _PWM6DCH_PWMPW2_POSITION                            0x0
#define _PWM6DCH_PWMPW2_SIZE                                0x1
#define _PWM6DCH_PWMPW2_LENGTH                              0x1
#define _PWM6DCH_PWMPW2_MASK                                0x1
#define _PWM6DCH_PWMPW3_POSN                                0x1
#define _PWM6DCH_PWMPW3_POSITION                            0x1
#define _PWM6DCH_PWMPW3_SIZE                                0x1
#define _PWM6DCH_PWMPW3_LENGTH                              0x1
#define _PWM6DCH_PWMPW3_MASK                                0x2
#define _PWM6DCH_PWMPW4_POSN                                0x2
#define _PWM6DCH_PWMPW4_POSITION                            0x2
#define _PWM6DCH_PWMPW4_SIZE                                0x1
#define _PWM6DCH_PWMPW4_LENGTH                              0x1
#define _PWM6DCH_PWMPW4_MASK                                0x4
#define _PWM6DCH_PWMPW5_POSN                                0x3
#define _PWM6DCH_PWMPW5_POSITION                            0x3
#define _PWM6DCH_PWMPW5_SIZE                                0x1
#define _PWM6DCH_PWMPW5_LENGTH                              0x1
#define _PWM6DCH_PWMPW5_MASK                                0x8
#define _PWM6DCH_PWMPW6_POSN                                0x4
#define _PWM6DCH_PWMPW6_POSITION                            0x4
#define _PWM6DCH_PWMPW6_SIZE                                0x1
#define _PWM6DCH_PWMPW6_LENGTH                              0x1
#define _PWM6DCH_PWMPW6_MASK                                0x10
#define _PWM6DCH_PWMPW7_POSN                                0x5
#define _PWM6DCH_PWMPW7_POSITION                            0x5
#define _PWM6DCH_PWMPW7_SIZE                                0x1
#define _PWM6DCH_PWMPW7_LENGTH                              0x1
#define _PWM6DCH_PWMPW7_MASK                                0x20
#define _PWM6DCH_PWMPW8_POSN                                0x6
#define _PWM6DCH_PWMPW8_POSITION                            0x6
#define _PWM6DCH_PWMPW8_SIZE                                0x1
#define _PWM6DCH_PWMPW8_LENGTH                              0x1
#define _PWM6DCH_PWMPW8_MASK                                0x40
#define _PWM6DCH_PWMPW9_POSN                                0x7
#define _PWM6DCH_PWMPW9_POSITION                            0x7
#define _PWM6DCH_PWMPW9_SIZE                                0x1
#define _PWM6DCH_PWMPW9_LENGTH                              0x1
#define _PWM6DCH_PWMPW9_MASK                                0x80

// Register: PWM6CON
#define PWM6CON PWM6CON
extern volatile unsigned char           PWM6CON             __at(0x38E);
#ifndef _LIB_BUILD
asm("PWM6CON equ 038Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM6POL                :1;
        unsigned PWM6OUT                :1;
        unsigned                        :1;
        unsigned PWM6EN                 :1;
    };
} PWM6CONbits_t;
extern volatile PWM6CONbits_t PWM6CONbits __at(0x38E);
// bitfield macros
#define _PWM6CON_POL_POSN                                   0x4
#define _PWM6CON_POL_POSITION                               0x4
#define _PWM6CON_POL_SIZE                                   0x1
#define _PWM6CON_POL_LENGTH                                 0x1
#define _PWM6CON_POL_MASK                                   0x10
#define _PWM6CON_OUT_POSN                                   0x5
#define _PWM6CON_OUT_POSITION                               0x5
#define _PWM6CON_OUT_SIZE                                   0x1
#define _PWM6CON_OUT_LENGTH                                 0x1
#define _PWM6CON_OUT_MASK                                   0x20
#define _PWM6CON_EN_POSN                                    0x7
#define _PWM6CON_EN_POSITION                                0x7
#define _PWM6CON_EN_SIZE                                    0x1
#define _PWM6CON_EN_LENGTH                                  0x1
#define _PWM6CON_EN_MASK                                    0x80
#define _PWM6CON_PWM6POL_POSN                               0x4
#define _PWM6CON_PWM6POL_POSITION                           0x4
#define _PWM6CON_PWM6POL_SIZE                               0x1
#define _PWM6CON_PWM6POL_LENGTH                             0x1
#define _PWM6CON_PWM6POL_MASK                               0x10
#define _PWM6CON_PWM6OUT_POSN                               0x5
#define _PWM6CON_PWM6OUT_POSITION                           0x5
#define _PWM6CON_PWM6OUT_SIZE                               0x1
#define _PWM6CON_PWM6OUT_LENGTH                             0x1
#define _PWM6CON_PWM6OUT_MASK                               0x20
#define _PWM6CON_PWM6EN_POSN                                0x7
#define _PWM6CON_PWM6EN_POSITION                            0x7
#define _PWM6CON_PWM6EN_SIZE                                0x1
#define _PWM6CON_PWM6EN_LENGTH                              0x1
#define _PWM6CON_PWM6EN_MASK                                0x80

// Register: NCO1ACC
#define NCO1ACC NCO1ACC
#ifndef __CCI__
extern volatile __uint24                NCO1ACC             __at(0x58C);
#endif
#ifndef _LIB_BUILD
asm("NCO1ACC equ 058Ch");
#endif

